Goodjamp/nrf52840Mouse/nRF5_SDK_14.2.0_17b948a/examples/ble_peripheral/ble_app_hids_mouse/main.c
#define APP_FEATURE_NOT_SUPPORTED       BLE_GATT_STATUS_ATTERR_APP_BEGIN + 2        /**< Reply when unsupported features are requested. */

#define APP_ADV_FAST_INTERVAL           0x0028                                      /**< Fast advertising interval (in units of 0.625 ms. This value corresponds to 25 ms.). */
#define APP_ADV_SLOW_INTERVAL           0x0C80                                      /**< Slow advertising interval (in units of 0.625 ms. This value corrsponds to 2 seconds). */
#define APP_ADV_FAST_TIMEOUT            10                                          /**< The duration of the fast advertising period (in seconds). */
#define APP_ADV_SLOW_TIMEOUT            10                                         /**< The duration of the slow advertising period (in seconds). */


APP_TIMER_DEF(m_battery_timer_id);                                                  /**< Battery timer. */
BLE_BAS_DEF(m_bas);                                                                 /**< Battery service instance. */
BLE_HIDS_DEF(m_hids);                                                               /**< HID service instance. */
NRF_BLE_GATT_DEF(m_gatt);                                                           /**< GATT module instance. */
BLE_ADVERTISING_DEF(m_advertising);                                                 /**< Advertising module instance. */

static bool              m_in_boot_mode = false;                                    /**< Current protocol mode. */
static uint16_t          m_conn_handle  = BLE_CONN_HANDLE_INVALID;                  /**< Handle of the current connection. */
static pm_peer_id_t      m_peer_id;                                                 /**< Device reference handle to the current bonded central. */
static sensorsim_cfg_t   m_battery_sim_cfg;                                         /**< Battery Level sensor simulator configuration. */
static sensorsim_state_t m_battery_sim_state;                                       /**< Battery Level sensor simulator state. */
static pm_peer_id_t      m_whitelist_peers[BLE_GAP_WHITELIST_ADDR_MAX_COUNT];       /**< List of peers currently in the whitelist. */
static uint32_t          m_whitelist_peer_cnt;                                      /**< Number of peers currently in the whitelist. */
static ble_uuid_t        m_adv_uuids[] =                                            /**< Universally unique service identifiers. */
{
    {BLE_UUID_HUMAN_INTERFACE_DEVICE_SERVICE, BLE_UUID_TYPE_BLE}
};


static void on_hids_evt(ble_hids_t * p_hids, ble_hids_evt_t * p_evt);
static void ble_evt_handler(ble_evt_t const * p_ble_evt, void * p_context);
static void pm_evt_handler(pm_evt_t const * p_evt);
static void on_adv_evt(ble_adv_evt_t ble_adv_evt);
static void ble_advertising_error_handler(uint32_t nrf_error);
static void peer_list_get(pm_peer_id_t * p_peers, uint32_t * p_size);


/**@brief Function for starting advertising for direct connect to device according order.
 *        This process include two phase: scanning, one item white list advertising
          - scanning:   high density advertising with rejection ALL input connection for detect device from white list around
          - connection: advertising with ONE WHITE LIST device and serially switch device on white list
          I should add state machine for global control advertising process: power on adv, normal adv and so on
          On processing of power On adv I should switch phase of adv.

 */

#include "ble_flash.h"
#include "nrf_nvmc.h"

#include "fds.h"

#include "orderProcessing.h"
#include "systemTime.h"

#define DETECTED_DEV_FREE    0xFF
#define DIRECT_CONN_QUANTITY 0x3

#define FILE_ORDER                               0xBAAB  /* The ID of the file to write the records into. */
#define RECORD_KEY_ORDER                         0xABBA  /* A key for the second record. */

#define APP_ADV_GLOBAL_INTERVAL           0x0023      /**< Fast advertising interval (in units of 0.625 ms. This value corresponds to 21 ms.). */
#define APP_ADV_GLOBAL_TIMEOUT              6000     /**< The duration of the fast advertising period (in seconds). */


#define APP_ADV_FAST_SCANING_INTERVAL           0x0023      /**< Fast advertising interval (in units of 0.625 ms. This value corresponds to 21 ms.). */
#define APP_ADV_FAST_SCANING_TIMEOUT                10     /**< The duration of the fast advertising period (in seconds). */

#define APP_ADV_FAST_CONNECT_INTERVAL           0x0023      /**< Fast advertising interval (in units of 0.625 ms. This value corresponds to 21 ms.). */
#define APP_ADV_FAST_CONNECT_TIMEOUT                10     /**< The duration of the fast advertising period (in seconds). */

#define APP_ADV_FAST_SEARCH_INTERVAL           0x0140      /**< Fast advertising interval (in units of 0.625 ms. This value corresponds to 200 ms.). */
#define APP_ADV_FAST_SEARCH_TIMEOUT                60     /**< The duration of the fast advertising period (in seconds). */

#define ORDER_FLASHE_PAGE                         254

#define ADV_RECONNECT_SCAN_TIMEOUT               8000

#define GET_PAGE_ADDRESS(X)  (uint32_t)(X*4096)


typedef enum
{
    ADV_PROC_START_CONNECT,
    ADV_PROC_STOP_ADV,
    ADV_PROC_CONNECT,
}nrfBLEAdvEvT;

typedef enum
{
    DEV_SCANNING,
    DEV_CONNECTION,
}connPhase;

typedef enum
{
    ADV_IDLE,              // Mo advertising
    ADV_GENERAL,           // after power on without bonds OR after erase all bonds
    ADV_ADD_NEW,           // after press connect pushbutton
    ADV_RECONNECT_SCAN,    // after power on with bonds    OR after disconnect
    ADV_RECONNECT_CONNECT,
}advTypeT;

typedef enum
{
    CONNECTION_CONNECT          = 0x0,
    CONNECTION_START_DISCONNECT = 0x1,
    CONNECTION_DISCONNECT       = 0x2,
}connectionStateT;


struct
{
    connPhase phase;
    uint16_t  listDetectedDev[BLE_GAP_WHITELIST_ADDR_MAX_COUNT];
    uint8_t   quantityDetectedDev;
    uint8_t   connectCnt;
    uint8_t   loopCnt;
}advDirOrdConnState =
{
    .listDetectedDev = {[0 ... BLE_GAP_WHITELIST_ADDR_MAX_COUNT-1] = DETECTED_DEV_FREE}
};

orderT        deviceOrder;
timerCallbacT stopScanAdvTimerCallback;
timerCallbacT switchToConnAdvTimerCallback;
struct{
    bool             clearBonds;
    bool             isRealAdv;
    bool             isAppAdv;
    advTypeT         currentAdvType;
    connectionStateT connectState;
} appState =
{
    .clearBonds     = false,                  // do we need clear bonds
    .isRealAdv      = false,                  // real state of advertising
    .isAppAdv       = false,                  // is advertising: true, false
    .currentAdvType = ADV_IDLE,               // current advertising state
    .connectState   = CONNECTION_DISCONNECT,  // current connection state
};
uint32_t scaningTimeout;


advTypeT getAppcurrentAdvType(void)
{
    return appState.currentAdvType;
}


void appDisconnect(void)
{
    if(appState.connectState != CONNECTION_CONNECT)
    {
        return;
    }
    appState.connectState = CONNECTION_START_DISCONNECT;
    sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);

