Goodjamp/nrf52840Mouse/nRF5_SDK_14.2.0_17b948a/examples/ble_peripheral/ble_app_hids_mouse/main.c
        appState.currentAdvType = ADV_RECONNECT_SCAN;
        break;
    default:
        break;
    }
    //NRF_LOG_INFO("Config Ok");
    ret = pm_whitelist_set((m_whitelist_peer_cnt == 0 ) ? (NULL) : (m_whitelist_peers),
                           (m_whitelist_peer_cnt == 0 ) ? (0)    : (m_whitelist_peer_cnt));
    ret = pm_device_identities_list_set((m_whitelist_peer_cnt == 0 ) ? (NULL) : (m_whitelist_peers),
                                        (m_whitelist_peer_cnt == 0 ) ? (0)    : (m_whitelist_peer_cnt));

    if (ret != NRF_ERROR_NOT_SUPPORTED)
    {
        APP_ERROR_CHECK(ret);
    }
    NRF_LOG_INFO("------stagit add --allt adv1-------");
    appState.isAppAdv = true;
    //sd_ble_gap_adv_stop();  // use this stop adv for activate white list with new devices
    ret = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);
    APP_ERROR_CHECK(ret);
}


void advertisingAddNew(nrfBLEAdvEvT inEv, uint16_t connHandle, pm_peer_id_t peerId)
{
    ret_code_t err_code;
    if(!peerIdInList(peerId))
    {
        NRF_LOG_INFO("No device on the list");
        return;
    }
    NRF_LOG_INFO("Disconnect old dev");
    err_code = sd_ble_gap_disconnect(connHandle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
    if (err_code != NRF_ERROR_INVALID_STATE)
    {
        APP_ERROR_CHECK(err_code);
    }
}


void advertisingDirectProc(nrfBLEAdvEvT inEv, uint16_t connHandle, pm_peer_id_t peerId)
{
    ret_code_t err_code;
    switch(inEv)
    {
    case ADV_PROC_START_CONNECT: // 1
        NRF_LOG_INFO("CONNECT");
        switch(advDirOrdConnState.phase)
        {
        case DEV_SCANNING:  // add device to the list of device that was detected
        {
            uint8_t pos;
            // disconnect input connection
            NRF_LOG_INFO("_SCANNING_");

            uint8_t cnt = 0;
            for(; cnt < m_whitelist_peer_cnt; cnt++)
            {
                if(m_whitelist_peers[cnt] == peerId)
                {
                    break;
                }

            }
            if(cnt < m_whitelist_peer_cnt)
            {
                NRF_LOG_INFO("remove dev %d", m_whitelist_peers[cnt] );
                for(; cnt < (m_whitelist_peer_cnt - 1); cnt++)
                {
                    m_whitelist_peers[cnt] = m_whitelist_peers[cnt+1];//
                }
                m_whitelist_peer_cnt--;
                m_whitelist_peers[cnt] = PM_PEER_ID_INVALID;
                NRF_LOG_INFO("PDL quan %d", m_whitelist_peer_cnt);


                err_code = pm_whitelist_set((m_whitelist_peer_cnt == 0 ) ? (NULL) : (m_whitelist_peers),
                                       (m_whitelist_peer_cnt == 0 ) ? (0)    : (m_whitelist_peer_cnt));
                APP_ERROR_CHECK(err_code);
                // Setup the device identies list.
                // Some SoftDevices do not support this feature.
                err_code = pm_device_identities_list_set((m_whitelist_peer_cnt == 0 ) ? (NULL) : (m_whitelist_peers),
                                                    (m_whitelist_peer_cnt == 0 ) ? (0)    : (m_whitelist_peer_cnt));
                APP_ERROR_CHECK(err_code);
            }
            //disconnect current device
            err_code = sd_ble_gap_disconnect(connHandle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            if (err_code != NRF_ERROR_INVALID_STATE)
            {
                APP_ERROR_CHECK(err_code);
            }

            NRF_LOG_INFO("--------Dev in list ? %d", peerId);
            if(orderGetPos(deviceOrder, peerId, &pos))
            {
                NRF_LOG_INFO("Dev find %d  d%", peerId, pos);
                if(advDirOrdConnState.listDetectedDev[pos] == DETECTED_DEV_FREE)
                {
                    NRF_LOG_INFO("Dev save");
                    advDirOrdConnState.listDetectedDev[pos] = peerId;
                    advDirOrdConnState.quantityDetectedDev++;
                }
            }

            if(advDirOrdConnState.quantityDetectedDev >= BLE_GAP_WHITELIST_ADDR_MAX_COUNT)
            {
                NRF_LOG_INFO("---------SCANED TIME = %d", getTime() - scaningTimeout);
                sd_ble_gap_adv_stop();
                appState.isAppAdv = false;
            }

        }
        break;
        case DEV_CONNECTION:// DO NOTHING (continue connection processing)
            /*DISCONNECT CURRENT DEVICE IF IT PEER ID DON'T EQUAL CURRENT DEVICE FROM WHITE LIST !!!! */
            NRF_LOG_INFO("_CONNECTION_");
            break;
        }
        break;
    case ADV_PROC_STOP_ADV:
        NRF_LOG_INFO("STOP_ADV");
        switch(advDirOrdConnState.phase)
        {
        case DEV_SCANNING: // stop adv for previous phase and start connection to detected devices
        {
            uint8_t cnt_1 = 0;
            uint8_t cnt_2 = 0;
            NRF_LOG_INFO("_SCANNING_");
            NRF_LOG_INFO("Find %d", advDirOrdConnState.quantityDetectedDev);
            // if device wasn't detected  start adv again
            if(advDirOrdConnState.quantityDetectedDev == 0)
            {
                advertisingApStart(ADV_RECONNECT_SCAN , 0);
                break;
            }
            // shift all devices on list UP
            for(cnt_1 = 0; cnt_1 < BLE_GAP_WHITELIST_ADDR_MAX_COUNT - 1; cnt_1++)
            {
                for(cnt_2 = BLE_GAP_WHITELIST_ADDR_MAX_COUNT-1; cnt_2 > 0; cnt_2--)
                {
                    if(advDirOrdConnState.listDetectedDev[cnt_2 - 1] == DETECTED_DEV_FREE &&
                            advDirOrdConnState.listDetectedDev[cnt_2 ]    != DETECTED_DEV_FREE)
                    {
                        advDirOrdConnState.listDetectedDev[cnt_2 - 1] = advDirOrdConnState.listDetectedDev[cnt_2 ];
                        advDirOrdConnState.listDetectedDev[cnt_2 ]    = DETECTED_DEV_FREE;
                    }
                }
            }

            advDirOrdConnState.connectCnt = 0;
            NRF_LOG_INFO("+++++++++");
            advertisingApStart(ADV_RECONNECT_CONNECT , advDirOrdConnState.listDetectedDev[advDirOrdConnState.connectCnt]);
            NRF_LOG_INFO("---------");
            advDirOrdConnState.phase = DEV_CONNECTION;
        }
        break;
        case DEV_CONNECTION:   /*
            on this point I can go in two cases:
            - current device from WL was not able connect
            - LAST DEVICE THAT WAS IN CONNECT-> DISACONNECT STATE BEFOR STOP SCANNIN WAS DISCONNECTED

            */
            NRF_LOG_INFO("_CONNECTION_");
            if(advDirOrdConnState.connectCnt >= advDirOrdConnState.quantityDetectedDev)
            {

