Goodjamp/nrf52840Mouse/nRF5_SDK_14.2.0_17b948a/examples/ble_peripheral/ble_app_hids_mouse/main.c
                advDirOrdConnState.loopCnt++;

                if(advDirOrdConnState.loopCnt >= DIRECT_CONN_QUANTITY)
                {
                    // start general advertising
                    break;
                }
                // start scanning again
                memset(advDirOrdConnState.listDetectedDev, DETECTED_DEV_FREE, sizeof(advDirOrdConnState.listDetectedDev));
                advDirOrdConnState.connectCnt = 0;
                advDirOrdConnState.phase      = DEV_SCANNING;
                advertisingApStart(ADV_RECONNECT_SCAN, 0);
            }
            // shift to next detected device
            advDirOrdConnState.connectCnt++;
            advertisingApStart(ADV_RECONNECT_CONNECT, advDirOrdConnState.listDetectedDev[advDirOrdConnState.connectCnt]);
            break;
        }
        break;
    default:
        break;
    }
}


void advertisingProcessing(nrfBLEAdvEvT inEv, uint16_t connHandle, pm_peer_id_t peerId)
{
    switch(appState.currentAdvType)
    {
    case ADV_GENERAL:
        NRF_LOG_INFO("ADV_GENERAL");
        break;
    case ADV_ADD_NEW:
        NRF_LOG_INFO("ADV_ADD_NEW");
        advertisingAddNew(inEv, connHandle, peerId);
        break;
    case ADV_RECONNECT_SCAN:
        NRF_LOG_INFO("ADV_SCAN");
        advertisingDirectProc(inEv, connHandle, peerId);
        break;
    case ADV_RECONNECT_CONNECT:
        NRF_LOG_INFO("ADV_CONNECT");
        advertisingDirectProc(inEv, connHandle, peerId);
        break;
    default:
        break;
    }
}


void advScanStop(void)
{
    NRF_LOG_INFO("Stop Scan");
    appState.isAppAdv   = false;
    advertisingProcessing(ADV_PROC_STOP_ADV, 0, 0);
}


void flashMemWriteBytes(uint32_t flashAddress, uint8_t buffer[], uint32_t bufferSize)
{
    fds_record_t        record;
    fds_record_desc_t   record_desc;
    // Set up record.
    record.file_id           = FILE_ORDER;
    record.key               = RECORD_KEY_ORDER;
    record.data.p_data       = buffer;
    record.data.length_words = (bufferSize+ 3) / 4;
    ret_code_t ret;
    fds_find_token_t    ftok;

    /* It is required to zero the token before first use. */
    memset(&ftok, 0x00, sizeof(fds_find_token_t));

    // delete all previous records with the same KEY and ID
    while (fds_record_find(FILE_ORDER, RECORD_KEY_ORDER, &record_desc, &ftok) == FDS_SUCCESS)
    {
        ret = fds_record_delete(&record_desc);
        if (ret != FDS_SUCCESS)
        {
        /* Error. */
        }
    }
    ret = fds_record_write(&record_desc, &record);
    if (ret != FDS_SUCCESS)
    {
        /* Handle error. */
    }
}


void flashMemReadBytes(uint32_t flashAddress, uint8_t buffer[], uint32_t bufferSize)
{
    fds_flash_record_t  flash_record;
    fds_record_desc_t   record_desc;
    fds_find_token_t    ftok;

    /* It is required to zero the token before first use. */
    memset(&ftok, 0x00, sizeof(fds_find_token_t));
    /* Loop until all records with the given key and file ID have been found. */
    // while (fds_record_find(FILE_ORDER, RECORD_KEY_ORDER, &record_desc, &ftok) == FDS_SUCCESS)
    while (fds_record_find(FILE_ORDER, RECORD_KEY_ORDER, &record_desc, &ftok) == FDS_SUCCESS)
    {
        NRF_LOG_INFO("Read start");
        if (fds_record_open(&record_desc, &flash_record) != FDS_SUCCESS)
        {
            /* Handle error. */
        }

        memcpy(buffer, (uint8_t*)flash_record.p_data, bufferSize);

        /* Access the record through the flash_record structure. */
        /* Close the record when done. */
        if (fds_record_close(&record_desc) != FDS_SUCCESS)
        {
            /* Handle error. */
        }
    }
    NRF_LOG_INFO("Read End");
}




/**@brief Callback function for asserts in the SoftDevice.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyze
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in]   line_num   Line number of the failing ASSERT call.
 * @param[in]   file_name  File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}


/**@brief Fetch the list of peer manager peer IDs.
 *
 * @param[inout] p_peers   The buffer where to store the list of peer IDs.
 * @param[inout] p_size    In: The size of the @p p_peers buffer.
 *                         Out: The number of peers copied in the buffer.
 */
static void peer_list_get(pm_peer_id_t * p_peers, uint32_t * p_size)
{
    pm_peer_id_t peer_id;
    uint32_t     peers_to_copy;

    peers_to_copy = (*p_size < BLE_GAP_WHITELIST_ADDR_MAX_COUNT) ?
                     *p_size : BLE_GAP_WHITELIST_ADDR_MAX_COUNT;

    peer_id = pm_next_peer_id_get(PM_PEER_ID_INVALID);
    *p_size = 0;

    while ((peer_id != PM_PEER_ID_INVALID) && (peers_to_copy--))
    {
        p_peers[(*p_size)++] = peer_id;
        peer_id = pm_next_peer_id_get(peer_id);
    }
}


/**@brief Clear bond information from persistent storage.
 */
static void delete_bonds(void)
{
    ret_code_t err_code;

    NRF_LOG_INFO("Erase bonds!");

    err_code = pm_peers_delete();
    NRF_LOG_INFO("DELETE ERR %d", err_code);
    APP_ERROR_CHECK(err_code);
}





/**@brief Function for starting advertising.
 */
 /*
static void advertising_start(bool erase_bonds)
{
    if (erase_bonds == true)
    {
        delete_bonds();
        // Advertising is started by PM_EVT_PEERS_DELETE_SUCCEEDED event.
    }
    else
    {
        ret_code_t ret;

        memset(m_whitelist_peers, PM_PEER_ID_INVALID, sizeof(m_whitelist_peers));
        m_whitelist_peer_cnt = (sizeof(m_whitelist_peers) / sizeof(pm_peer_id_t));

        peer_list_get(m_whitelist_peers, &m_whitelist_peer_cnt);

         NRF_LOG_INFO("Number Peer %d", m_whitelist_peer_cnt);

        ret = pm_whitelist_set(m_whitelist_peers, m_whitelist_peer_cnt);
        APP_ERROR_CHECK(ret);

        // Setup the device identies list.
        // Some SoftDevices do not support this feature.
        ret = pm_device_identities_list_set(m_whitelist_peers, m_whitelist_peer_cnt);
        if (ret != NRF_ERROR_NOT_SUPPORTED)
        {
            APP_ERROR_CHECK(ret);
        }

        NRF_LOG_INFO("------start adv6-------");
        ret = ble_advertising_start(&m_advertising, BLE_ADV_MODE_DIRECTED);
        APP_ERROR_CHECK(ret);
    }
}
*/



/**@brief Function for handling Service errors.
 *
 * @details A pointer to this function will be passed to each service which may need to inform the
 *          application about an error.
 *
 * @param[in]   nrf_error   Error code containing information about what went wrong.
 */
static void service_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}


