Goodjamp/nrf52840Mouse/nRF5_SDK_14.2.0_17b948a/examples/ble_peripheral/ble_app_hids_mouse/main.c
        case BSP_EVENT_KEY_1:
            NRF_LOG_INFO("KEY_1");
            if (m_conn_handle != BLE_CONN_HANDLE_INVALID)
            {
                NRF_LOG_INFO("OK");
                mouse_movement_send(0, -MOVEMENT_SPEED);
            }
            break;

        case BSP_EVENT_KEY_2:
            NRF_LOG_INFO("Clear all bonds");
            appState.clearBonds = true;

            break;

        case BSP_EVENT_KEY_3:
           NRF_LOG_INFO("ADD_NEW adv start");
           advertisingApStart(ADV_ADD_NEW, 0);
           break;

        default:
            break;
    }
}


/**@brief Function for initializing buttons and leds.
 *
 * @param[out] p_erase_bonds  Will be true if the clear bonding button was pressed to wake the application up.
 */
static void buttons_leds_init(bool * p_erase_bonds)
{
    ret_code_t err_code;
    bsp_event_t startup_event;

    err_code = bsp_init(BSP_INIT_LED | BSP_INIT_BUTTONS, bsp_event_handler);

    APP_ERROR_CHECK(err_code);

    err_code = bsp_btn_ble_init(NULL, &startup_event);
    APP_ERROR_CHECK(err_code);

    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}


/**@brief Function for initializing the nrf log module.
 */
static void log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_DEFAULT_BACKENDS_INIT();
}


/**@brief Function for the Power manager.
 */
static void power_manage(void)
{
    ret_code_t err_code = sd_app_evt_wait();
    APP_ERROR_CHECK(err_code);
}


// Simple event handler to handle errors during initialization.
static void fds_evt_handler(fds_evt_t const * p_fds_evt)
{
    switch(p_fds_evt->id)
    {
        case  FDS_EVT_INIT:       NRF_LOG_INFO("FDS_EVT_INIT");        break;
        case  FDS_EVT_WRITE:      NRF_LOG_INFO("FDS_EVT_WRITE");       break;
        case  FDS_EVT_UPDATE:     NRF_LOG_INFO("FDS_EVT_UPDATE");      break;
        case  FDS_EVT_DEL_RECORD: NRF_LOG_INFO("FDS_EVT_DEL_RECORD");  break;
        case  FDS_EVT_DEL_FILE:   NRF_LOG_INFO("FDS_EVT_DEL_FILE");    break;
        case  FDS_EVT_GC:         NRF_LOG_INFO("FDS_EVT_GC");          break;
    }

    switch (p_fds_evt->id)
    {
        case FDS_EVT_INIT:
            if (p_fds_evt->result != FDS_SUCCESS)
            {
                // Initialization failed.
            }
            break;
        default:
            break;
    }
}


/**@brief Function for application main entry.
 */
int main(void)
{
    bool erase_bonds;

    // Initialize.
    log_init();
    NRF_LOG_INFO("Gerasimchuk started.");

    initUserTimer();
    stopScanAdvTimerCallback     = timerGetCallback(advScanStop);
    deviceOrder = orderMalloc();
    ret_code_t ret = fds_register(fds_evt_handler);
    if (ret != FDS_SUCCESS)
    {
    // Registering of the FDS event handler has failed.
    }
    ret = fds_init();
    if (ret != FDS_SUCCESS)
    {
    // Handle error.
    }
    //orderWriteFlash(deviceOrder, GET_PAGE_ADDRESS(ORDER_FLASHE_PAGE));
    orderReadFlash(deviceOrder, GET_PAGE_ADDRESS(ORDER_FLASHE_PAGE));

    for(uint8_t cnt = 0; cnt < ORDER_ITEM_QUANTITY; cnt++ )
    {
        NRF_LOG_INFO("item = %d \n", orderGetItem(deviceOrder, cnt));
    }

    timers_init();
    buttons_leds_init(&erase_bonds);
    ble_stack_init();
    scheduler_init();
    gap_params_init();
    gatt_init();
    services_init();
    sensor_simulator_init();
    conn_params_init();
    peer_manager_init();
    // Start execution.

    timers_start();
    advertising_init(APP_ADV_GLOBAL_INTERVAL, APP_ADV_GLOBAL_TIMEOUT, true);
    advertisingApStart(ADV_RECONNECT_SCAN, 0);

    // Enter main loop.
    for (;;)
    {
        app_sched_execute();

        if(appState.clearBonds &&  m_conn_handle == BLE_CONN_HANDLE_INVALID)
        {
            appState.clearBonds = false;
            NRF_LOG_INFO("Clear b_start");
            delete_bonds();
            orderClean(deviceOrder);
            orderWriteFlash(deviceOrder, GET_PAGE_ADDRESS(ORDER_FLASHE_PAGE));
        }
        userProcessingTimerCallbackFun();

        if (NRF_LOG_PROCESS() == false)
        {
            power_manage();
        }
    }
}



/**
 * @}
 */


/**@brief Function for handling BLE events.
 *
 * @param[in]   p_ble_evt   Bluetooth stack event.
 * @param[in]   p_context   Unused.
 */
static void ble_evt_handler(ble_evt_t const * p_ble_evt, void * p_context)
{
    ret_code_t err_code;

    switch(p_ble_evt->header.evt_id)
    {
         case BLE_GAP_EVT_CONNECTED:                  NRF_LOG_INFO("CONNECTED");                  break;
         case BLE_GAP_EVT_DISCONNECTED:               NRF_LOG_INFO("DISCONNECTED");               break;
         case BLE_GAP_EVT_CONN_PARAM_UPDATE:          NRF_LOG_INFO("CONN_PARAM_UPDATE");          break;
         case BLE_GAP_EVT_SEC_PARAMS_REQUEST:         NRF_LOG_INFO("SEC_PARAMS_REQUEST");         break;
         case BLE_GAP_EVT_SEC_INFO_REQUEST:           NRF_LOG_INFO("SEC_INFO_REQUEST");           break;
         case BLE_GAP_EVT_PASSKEY_DISPLAY:            NRF_LOG_INFO("PASSKEY_DISPLAY");            break;
         case BLE_GAP_EVT_KEY_PRESSED:                NRF_LOG_INFO("KEY_PRESSED");                break;
         case BLE_GAP_EVT_AUTH_KEY_REQUEST:           NRF_LOG_INFO("AUTH_KEY_REQUEST");           break;
         case BLE_GAP_EVT_LESC_DHKEY_REQUEST:         NRF_LOG_INFO("LESC_DHKEY_REQUEST");         break;
         case BLE_GAP_EVT_AUTH_STATUS:                NRF_LOG_INFO("AUTH_STATUS");                break;
         case BLE_GAP_EVT_CONN_SEC_UPDATE:            NRF_LOG_INFO("CONN_SEC_UPDATE");            break;
         case BLE_GAP_EVT_TIMEOUT:                    NRF_LOG_INFO("TIMEOUT");                    break;
         case BLE_GAP_EVT_RSSI_CHANGED:               NRF_LOG_INFO("RSSI_CHANGED");               break;
         case BLE_GAP_EVT_ADV_REPORT:                 NRF_LOG_INFO("ADV_REPORT");                 break;
         case BLE_GAP_EVT_SEC_REQUEST:                NRF_LOG_INFO("SEC_REQUEST");                break;
         case BLE_GAP_EVT_CONN_PARAM_UPDATE_REQUEST:  NRF_LOG_INFO("CONN_PARAM_UPDATE_REQUEST");  break;
         case BLE_GAP_EVT_SCAN_REQ_REPORT:            NRF_LOG_INFO("SCAN_REQ_REPORT");            break;
         case BLE_GAP_EVT_PHY_UPDATE:                 NRF_LOG_INFO("PHY_UPDATE");                 break;
         case BLE_GAP_EVT_DATA_LENGTH_UPDATE_REQUEST: NRF_LOG_INFO("DATA_LENGTH_UPDATE_REQUEST"); break;
         case BLE_GAP_EVT_DATA_LENGTH_UPDATE:         NRF_LOG_INFO("DATA_LENGTH_UPDATE");         break;
    }

    switch (p_ble_evt->header.evt_id)
    {
        case BLE_GAP_EVT_CONNECTED:

            err_code = bsp_indication_set(BSP_INDICATE_CONNECTED);
            APP_ERROR_CHECK(err_code);

