Goodjamp/nrf52840Mouse/nRF5_SDK_14.2.0_17b948a/examples/ble_peripheral/ble_app_hids_mouse/main.c
            m_conn_handle = p_ble_evt->evt.gap_evt.conn_handle;
            break;

        case BLE_GAP_EVT_DISCONNECTED:
            //NRF_LOG_INFO("Disconnected");
            // LED indication will be changed when advertising starts.

            m_conn_handle = BLE_CONN_HANDLE_INVALID;
            break;

#ifndef S140
        case BLE_GAP_EVT_PHY_UPDATE_REQUEST:
        {
            NRF_LOG_DEBUG("PHY update request.");
            ble_gap_phys_t const phys =
            {
                .rx_phys = BLE_GAP_PHY_AUTO,
                .tx_phys = BLE_GAP_PHY_AUTO,
            };
            err_code = sd_ble_gap_phy_update(p_ble_evt->evt.gap_evt.conn_handle, &phys);
            APP_ERROR_CHECK(err_code);
        } break;
#endif

        case BLE_GATTC_EVT_TIMEOUT:
            // Disconnect on GATT Client timeout event.
            NRF_LOG_DEBUG("GATT Client Timeout.");
            err_code = sd_ble_gap_disconnect(p_ble_evt->evt.gattc_evt.conn_handle,
                                             BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            APP_ERROR_CHECK(err_code);
            break;

        case BLE_GATTS_EVT_TIMEOUT:
            // Disconnect on GATT Server timeout event.
            NRF_LOG_DEBUG("GATT Server Timeout.");
            err_code = sd_ble_gap_disconnect(p_ble_evt->evt.gatts_evt.conn_handle,
                                             BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            APP_ERROR_CHECK(err_code);
            break;

        case BLE_EVT_USER_MEM_REQUEST:
            err_code = sd_ble_user_mem_reply(m_conn_handle, NULL);
            APP_ERROR_CHECK(err_code);
            break;

        case BLE_GATTS_EVT_RW_AUTHORIZE_REQUEST:
        {
            ble_gatts_evt_rw_authorize_request_t  req;
            ble_gatts_rw_authorize_reply_params_t auth_reply;

            req = p_ble_evt->evt.gatts_evt.params.authorize_request;

            if (req.type != BLE_GATTS_AUTHORIZE_TYPE_INVALID)
            {
                if ((req.request.write.op == BLE_GATTS_OP_PREP_WRITE_REQ)     ||
                    (req.request.write.op == BLE_GATTS_OP_EXEC_WRITE_REQ_NOW) ||
                    (req.request.write.op == BLE_GATTS_OP_EXEC_WRITE_REQ_CANCEL))
                {
                    if (req.type == BLE_GATTS_AUTHORIZE_TYPE_WRITE)
                    {
                        auth_reply.type = BLE_GATTS_AUTHORIZE_TYPE_WRITE;
                    }
                    else
                    {
                        auth_reply.type = BLE_GATTS_AUTHORIZE_TYPE_READ;
                    }
                    auth_reply.params.write.gatt_status = APP_FEATURE_NOT_SUPPORTED;
                    err_code = sd_ble_gatts_rw_authorize_reply(p_ble_evt->evt.gatts_evt.conn_handle,
                                                               &auth_reply);
                    APP_ERROR_CHECK(err_code);
                }
            }
        } break; // BLE_GATTS_EVT_RW_AUTHORIZE_REQUEST

        default:
            // No implementation needed.
            break;
    }
}




/**@brief Function for handling Peer Manager events.
 *
 * @param[in] p_evt  Peer Manager event.
 */
static void pm_evt_handler(pm_evt_t const * p_evt)
{
    ret_code_t err_code;

    switch(p_evt->evt_id)
    {
        case PM_EVT_BONDED_PEER_CONNECTED:         NRF_LOG_INFO("PM_EVT_BONDED_PEER_CONNECTED");         break;
        case PM_EVT_CONN_SEC_START:                NRF_LOG_INFO("PM_EVT_CONN_SEC_START");                break;
        case PM_EVT_CONN_SEC_SUCCEEDED:            NRF_LOG_INFO("PM_EVT_CONN_SEC_SUCCEEDED");            break;
        case PM_EVT_CONN_SEC_FAILED:               NRF_LOG_INFO("PM_EVT_CONN_SEC_FAILED");               break;
        case PM_EVT_CONN_SEC_CONFIG_REQ:           NRF_LOG_INFO("PM_EVT_CONN_SEC_CONFIG_REQ");           break;
        case PM_EVT_CONN_SEC_PARAMS_REQ:           NRF_LOG_INFO("PM_EVT_CONN_SEC_PARAMS_REQ");           break;
        case PM_EVT_STORAGE_FULL:                  NRF_LOG_INFO("PM_EVT_STORAGE_FULL");                  break;
        case PM_EVT_ERROR_UNEXPECTED:              NRF_LOG_INFO("PM_EVT_ERROR_UNEXPECTED");              break;
        case PM_EVT_PEER_DATA_UPDATE_SUCCEEDED:    NRF_LOG_INFO("PM_EVT_PEER_DATA_UPDATE_SUCCEEDED");    break;
        case PM_EVT_PEER_DATA_UPDATE_FAILED:       NRF_LOG_INFO("PM_EVT_PEER_DATA_UPDATE_FAILED");       break;
        case PM_EVT_PEER_DELETE_SUCCEEDED:         NRF_LOG_INFO("PM_EVT_PEER_DELETE_SUCCEEDED");         break;
        case PM_EVT_PEER_DELETE_FAILED:            NRF_LOG_INFO("PM_EVT_PEER_DELETE_FAILED");            break;
        case PM_EVT_PEERS_DELETE_SUCCEEDED:        NRF_LOG_INFO("PM_EVT_PEERS_DELETE_SUCCEEDED");        break;
        case PM_EVT_PEERS_DELETE_FAILED:           NRF_LOG_INFO("PM_EVT_PEERS_DELETE_FAILED");           break;
        case PM_EVT_LOCAL_DB_CACHE_APPLIED:        NRF_LOG_INFO("PM_EVT_LOCAL_DB_CACHE_APPLIED");        break;
        case PM_EVT_LOCAL_DB_CACHE_APPLY_FAILED:   NRF_LOG_INFO("PM_EVT_LOCAL_DB_CACHE_APPLY_FAILED");   break;
        case PM_EVT_SERVICE_CHANGED_IND_SENT:      NRF_LOG_INFO("PM_EVT_SERVICE_CHANGED_IND_SENT");      break;
        case PM_EVT_SERVICE_CHANGED_IND_CONFIRMED: NRF_LOG_INFO("PM_EVT_SERVICE_CHANGED_IND_CONFIRMED"); break;
        case PM_EVT_SLAVE_SECURITY_REQ:            NRF_LOG_INFO("PM_EVT_SLAVE_SECURITY_REQ");            break;
        case PM_EVT_FLASH_GARBAGE_COLLECTED:       NRF_LOG_INFO("PM_EVT_FLASH_GARBAGE_COLLECTED");       break;
    }

    switch (p_evt->evt_id)
    {

        case PM_EVT_BONDED_PEER_CONNECTED:
        {
            NRF_LOG_INFO("Prev con: %d", p_evt->peer_id);
            /******processing adv event************/
            advertisingProcessing(ADV_PROC_START_CONNECT, p_evt->conn_handle, p_evt->peer_id);
            /****** *******************************/
        } break;

        case PM_EVT_CONN_SEC_SUCCEEDED:
        {
            NRF_LOG_INFO("Connection secured: role: %d, conn_handle: 0x%x, procedure: %d.",
                         ble_conn_state_role(p_evt->conn_handle),
                         p_evt->conn_handle,
                         p_evt->params.conn_sec_succeeded.procedure);

            /* -AddOrder- Added new device to the order*/
            orderSetFirst(deviceOrder, p_evt->peer_id);
            orderWriteFlash(deviceOrder, GET_PAGE_ADDRESS(ORDER_FLASHE_PAGE));

            m_peer_id = p_evt->peer_id;

